In [2]:
import os, math, subprocess
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# some settings for displaying Pandas results
pd.set_option('display.width', 2000)
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.precision', 4)
pd.set_option('display.max_colwidth', -1)

In [7]:
# load data
df = pd.read_csv('bai1.csv')

In [13]:
print("""
    SELECT *
    FROM df
    LIMIT 3
""")
df.head(3)

    SELECT *
    FROM df
    LIMIT 3

   Unnamed: 0  age   name
0  0           12   truc
1  1           21   thanh
2  2           23   ngoc

In [17]:
condition =(df['age']<22)&(df['name']=='thanh')
df[condition][['name']].head()

    name
1  thanh

In [20]:
df[['name','age']].sort_values("age", ascending =False).head()

    name  age
2  ngoc   23
1  thanh  21
0  truc   12

In [30]:
print("""
    SELECT MAX(AMT_INCOME_TOTAL), MIN(AMT_INCOME_TOTAL), MEAN(AMT_INCOME_TOTAL)
    FROM pdf_data
""")

df.agg({"age": ["max", "min", "mean"]}).transpose()

    SELECT MAX(AMT_INCOME_TOTAL), MIN(AMT_INCOME_TOTAL), MEAN(AMT_INCOME_TOTAL)
    FROM pdf_data

      max   min     mean
age  23.0  12.0  18.6667

In [35]:
df1 = pd.DataFrame({'age': [1, 2], 'name': ['Harry Potter', 'Ron Weasley']})
df2 = pd.DataFrame({'age': [3,4], 'name': ['Hermione Granger','ngu']})
df3 = pd.concat([df1, df2]).reset_index(drop=True)
df4 = pd.concat([df3,df]).reset_index(drop=True)
df4

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

   Unnamed: 0  age              name
0 NaN          1    Harry Potter
1 NaN          2    Ron Weasley
2 NaN          3    Hermione Granger
3 NaN          4    ngu
4  0.0         12   truc
5  1.0         21   thanh
6  2.0         23   ngoc

In [40]:
df.loc[df["age"] == 12, "name"] = "Ngu truc"# change
df

   Unnamed: 0  age      name
0  0           12   Ngu truc
1  1           21   thanh
2  2           23   ngoc

In [43]:
df.drop(df[df["name"] == "ngoc"].index, inplace=True)
df

   Unnamed: 0  age      name
0  0           12   Ngu truc
1  1           21   thanh

In [58]:
df.rank()
df.shape
df.index
df.columns
print(df.info)
df['age'].min()
df['age'].max()
df['age'].mean()
df['age'].median()
df['age'].idxmin()
df['age'].idxmax()

<bound method DataFrame.info of    Unnamed: 0  age      name
0  0           12   Ngu truc
1  1           21   thanh   >

1

In [64]:
s3 = pd.Series([7, -2, 3], index=['a', 'c', 'd'])
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

s + s3
s.add(s3, fill_value=0)

a    10.0
b   -5.0
c    5.0
d    7.0
dtype: float64